Repository: LeePepe/VitalStride
Catalog: VitalStride/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# active_workout.heart_rate.disconnected
source: No Watch
zh_hans: 未连接

# active_workout.heart_rate.disconnected_a11y
source: Apple Watch not connected
zh_hans: 需 Apple Watch 连接

# active_workout.heart_rate.awaiting_a11y
source: Waiting for heart rate
zh_hans: 等待心率数据

# active_workout_toggle_large_text_size
source: Switch to large text size
zh_hans: 切换大字号

# active_workout_toggle_normal_text_size
source: Switch to normal text size
zh_hans: 切换普通字号

# active_workout.previous_set_hint_format
source: Previous %1$@ x %2$lld
zh_hans: 上次 %1$@ × %2$lld

# active_workout.substitute.menu_title
source: Smart Substitute
zh_hans: 智能替代

# active_workout.substitute.sheet_title
source: Smart Substitute
zh_hans: 智能替代

# active_workout.substitute.loading
source: Finding alternatives…
zh_hans: 正在寻找替代动作…

# active_workout.substitute.error_generic
source: Couldn't get smart suggestions right now.
zh_hans: 暂时无法获取智能推荐。

# active_workout.substitute.error_no_candidates
source: No matching alternatives found.
zh_hans: 未找到匹配的替代动作。

# active_workout.substitute.manual_select
source: Choose Manually
zh_hans: 手动选择

# active_workout.substitute.reason_label
source: Why
zh_hans: 推荐理由

# active_workout.substitute.card_a11y_hint
source: Double-tap to replace the current exercise with this suggestion.
zh_hans: 轻点两下用此推荐替换当前动作。

# workout_detail_hrr_1min
source: 1-min HRR
zh_hans: 1 分钟 HRR

# workout_detail_hrr_1min_a11y
source: 1-minute heart rate recovery %lld beats per minute
zh_hans: 1 分钟心率恢复 %lld 次每分钟

# workout_detail_estimated_1rm
source: Estimated 1RM
zh_hans: 预估 1RM

# workout_detail_view_1rm_trend
source: View 1RM Trend
zh_hans: 查看 1RM 趋势

# workout_detail_view_1rm_trend_a11y
source: View one rep max trend for this exercise
zh_hans: 查看该动作的 1RM 趋势

# one_rep_max_trend_title
source: Estimated 1RM Trend
zh_hans: 预估 1RM 趋势

# one_rep_max_trend_empty
source: No 1RM history yet
zh_hans: 暂无 1RM 记录

# one_rep_max_trend_empty_hint
source: Log working sets (1–12 reps) to see this exercise's estimated 1RM trend.
zh_hans: 记录正式组（1–12 次）后，可查看该动作的预估 1RM 趋势。

# one_rep_max_trend_caveat
source: Estimates are most accurate for 3–10 reps; sets with >15 reps can deviate significantly (Epley formula).
zh_hans: 3–10 次 时估算最准确；>15 次 的组偏差较大（Epley 公式）。

# one_rep_max_trend_single_point_hint
source: Only one session available — log more to see a trend line.
zh_hans: 只有一次记录 — 多记录几次可看到趋势线。

# one_rep_max_trend_point_count %lld
source: %lld sessions
zh_hans: %lld 次

# one_rep_max_trend_a11y %lld %@ %@ %@
source: Estimated 1RM trend with %1$lld sessions, from %2$@ to %3$@ %4$@
zh_hans: 预估 1RM 趋势，%1$lld 次记录，从 %2$@ 到 %3$@ %4$@

source: Date
zh_hans: 日期

source: -10s
zh_hans: -10 秒

source: , Suggestion: %@
zh_hans: ，建议：%@

# %@ %@ 步
source: %1$@ %2$@ 步
zh_hans: %@ %@ 步

source: %@ km
zh_hans: %@ 公里

# %@ 公里
source: %@ km
zh_hans: %@ 公里

# %@ 等
source: %@ etc.
zh_hans: %@ 等

source: %@, action
zh_hans: %@，操作

source: %@, interactive trend chart
zh_hans: %@，交互式趋势图

source: %@, tap to start
zh_hans: %@，点击开始

source: %@, trend chart
zh_hans: %@，趋势图

# %@，%@趋势图
source: %1$@，%2$@趋势图
zh_hans: %@，%@趋势图

# %@，心率 %lld BPM
source: %1$@，心率 %2$lld BPM
zh_hans: %@，心率 %lld BPM

# %@，总睡眠 %@，深睡 %@，浅睡 %@，REM %@
source: %1$@，总睡眠 %2$@，深睡 %3$@，浅睡 %4$@，REM %5$@
zh_hans: %@，总睡眠 %@，深睡 %@，浅睡 %@，REM %@

# %@分类下暂无动作
source: No exercises in %@
zh_hans: %@分类下暂无动作

# %@平均心率 %lld BPM
source: %1$@平均心率 %2$lld BPM
zh_hans: %@平均心率 %lld BPM

# %@平均睡眠 %@
source: %1$@平均睡眠 %2$@
zh_hans: %@平均睡眠 %@

# %lld 个动作
source: %lld exercises
zh_hans: %lld 个动作

# %lld 分钟
source: %lld min
zh_hans: %lld 分钟

# %lld 千卡
source: %lld kcal
zh_hans: %lld 千卡

# %lld 小时 %lld 分钟
source: %1$lld 小时 %2$lld 分钟
zh_hans: %lld 小时 %lld 分钟

# %lld 次
source: %lld reps
zh_hans: %lld 次

# %lld 次每分钟
source: %lld bpm
zh_hans: %lld 次每分钟

source: +10s
zh_hans: +10 秒

# action_go
source: Go
zh_hans: 前往

source: AI — Coming Soon
zh_hans: AI — 即将推出

# AI API Key 输入框
source: AI API key input
zh_hans: AI API Key 输入框

# AI Insight: %@, %@
source: AI Insight: %1$@, %2$@
zh_hans: AI 洞察：%@，%@

# AI 健康速览
source: AI Health Overview
zh_hans: AI 健康速览

# AI 分析
source: AI Analysis
zh_hans: AI 分析

# AI 分析会将你的训练数据（训练记录、组数、重量）和健康数据（心率、睡眠、步数）发送到第三方服务器进行分析。
source: AI Analysis will send your workout data (records, sets, weights) and health data (heart rate, sleep, steps) to a third-party server for analysis.
zh_hans: AI 分析会将你的训练数据（训练记录、组数、重量）和健康数据（心率、睡眠、步数）发送到第三方服务器进行分析。

# AI 分析功能需要智谱 AI 的 API Key。请在设置中配置后再使用。
source: AI Analysis requires a Zhipu AI API key. Please configure it in Settings before use.
zh_hans: AI 分析功能需要智谱 AI 的 API Key。请在设置中配置后再使用。

# AI 助手
source: AI Assistant
zh_hans: AI 助手

# AI 回复完成
source: AI reply complete
zh_hans: AI 回复完成

# AI 服务
source: AI Service
zh_hans: AI 服务

# AI 模型选择
source: AI Model Selection
zh_hans: AI 模型选择

# AI 正在回复
source: AI is replying
zh_hans: AI 正在回复

source: AI Analyzing...
zh_hans: AI 分析中…

# ai_quick_analysis_collapse
source: Collapse quick analysis
zh_hans: 收起快捷分析

# ai_quick_analysis_expand
source: Expand quick analysis
zh_hans: 展开快捷分析

# ai_quick_analysis_section_title
source: Quick analysis
zh_hans: 快捷分析

source: API Key
zh_hans: API 密钥

source: Apple Frameworks
zh_hans: Apple 框架

# Apple 健康训练
source: Apple Health Workouts
zh_hans: Apple 健康训练

source: Average
zh_hans: 平均值

source: Cancel
zh_hans: 取消

# card_size_large
source: Large
zh_hans: 大

# card_size_medium
source: Medium
zh_hans: 中

# card_size_small
source: Small
zh_hans: 小

# card_size_wide
source: Wide
zh_hans: 宽

# card_type_action
source: Action
zh_hans: 动作

# card_type_insight
source: Insight
zh_hans: 洞察

# card_type_list
source: List
zh_hans: 列表

# card_type_metric
source: Metric
zh_hans: 指标

# card_type_summary
source: Summary
zh_hans: 摘要

# card_type_trend
source: Trend
zh_hans: 趋势

# common_cancel
source: Cancel
zh_hans: 取消

# common_ok
source: OK
zh_hans: 好

source: Couldn't Save Workout
zh_hans: 无法保存训练

source: Discard
zh_hans: 丢弃

# generic_health_detail.loading
source: Loading…
zh_hans: 加载中…

# generic_health_detail.loading_a11y
source: Loading
zh_hans: 加载中

# generic_health_detail.refreshing
source: Updating…
zh_hans: 更新中…

# generic_health_detail.refreshing_a11y
source: Updating data
zh_hans: 正在更新数据

# headline_bar_a11y_hint
source: Tap to view update
zh_hans: 点击查看更新

# HealthKit 权限
source: HealthKit Permission
zh_hans: HealthKit 权限

# list_more
source: more
zh_hans: 更多

source: No data
zh_hans: 暂无数据

# overview_last_updated
source: 上次更新于 %@
zh_hans: 最后更新

# overview_missing_api_key
source: 请在设置中添加 API Key 以启用 AI 分析
zh_hans: 请先在设置中配置 AI API 密钥

# overview_muscle_group_chip_a11y
source: %1$@: %2$lld times
zh_hans: %1$@：%2$lld 次

# overview_muscle_group_frequency_title
source: Muscle group frequency (last 7 days)
zh_hans: 过去 7 天肌群分布

# overview_refresh_failed
source: 刷新失败，请稍后重试
zh_hans: 刷新失败

# overview_title
source: 概览
zh_hans: 健康概览

source: REM
zh_hans: 快速眼动

# rest_live_activity_a11y_label
source: Rest timer
zh_hans: 休息计时器

# rest_live_activity_compact_a11y
source: Remaining rest time
zh_hans: 剩余休息时间

# rest_live_activity_completed
source: Rest Complete
zh_hans: 休息结束

# rest_live_activity_completed_a11y
source: Rest complete
zh_hans: 休息结束

# rest_live_activity_title
source: Resting
zh_hans: 休息中

# rest_notification_body
source: Time for your next set
zh_hans: 开始下一组

# rest_notification_title
source: Rest Complete
zh_hans: 休息结束

# set_row_rpe_option_unset
source: Not set
zh_hans: 未标注

source: Resume
zh_hans: 恢复训练

source: Retry
zh_hans: 重试

source: Save & End
zh_hans: 保存并结束

source: Saving failed. You can retry, or cancel and try a different option.
zh_hans: 保存失败。你可以重试，或取消并尝试其他选项。

source: Selected
zh_hans: 已选择

source: Started at %@. Empty workout (no exercises) — recommend discarding.
zh_hans: 训练开始于 %@。空训练（未添加动作），建议丢弃。

source: Started at %@. Recorded %lld exercises across %lld sets.
zh_hans: 训练开始于 %1$@，已记录 %2$lld 个动作、%3$lld 组数据。

source: Unfinished Workout Detected
zh_hans: 检测到未完成的训练

source: Value
zh_hans: 数值

# VitalStride 使用了以下开源技术和框架：
source: VitalStride uses the following open-source technologies and frameworks:
zh_hans: VitalStride 使用了以下开源技术和框架：

# VitalStride 训练
source: VitalStride Workouts
zh_hans: VitalStride 训练

# VitalStride 需要访问你的健康数据来展示心率、步数等信息，并将训练记录写入 HealthKit。
source: VitalStride needs access to your health data to display heart rate, steps, and other information, and to write workout records to HealthKit.
zh_hans: VitalStride 需要访问你的健康数据来展示心率、步数等信息，并将训练记录写入 HealthKit。

# 上升趋势
source: Upward trend
zh_hans: 上升趋势

# 上次更新 %@
source: Last updated %@
zh_hans: 上次更新 %@

# 下降趋势
source: Downward trend
zh_hans: 下降趋势

# 个人记录
source: Personal Records
zh_hans: 个人记录

# 个人记录，点击检测历史最佳
source: Personal Records, tap to detect historical bests
zh_hans: 个人记录，点击检测历史最佳

# 今日活动
source: Today's Activity
zh_hans: 今日活动

# 今日活动进度
source: Today's activity progress
zh_hans: 今日活动进度

# 今日训练建议
source: Today's Workout Advice
zh_hans: 今日训练建议

# 从历史复制
source: Copy from History
zh_hans: 从历史复制

# 从模板开始
source: Start from Template
zh_hans: 从模板开始

# 从零开始，逐个添加动作
source: Start from scratch, add exercises one by one
zh_hans: 从零开始，逐个添加动作

# 付费
source: Paid
zh_hans: 付费

# 休息中 %llds / %llds
source: 休息中 %1$llds / %2$llds
zh_hans: 休息中 %llds / %llds

# 休息结束
source: Rest Complete
zh_hans: 休息结束

# 体脂率
source: Body Fat Percentage
zh_hans: 体脂率

# 体重
source: Body Weight
zh_hans: 体重

# 体重 %@ %@，%@
source: 体重 %1$@ %2$@，%3$@
zh_hans: 体重 %@ %@，%@

# 体重变化趋势图
source: Body weight trend chart
zh_hans: 体重变化趋势图

# 体重记录
source: Body Weight Records
zh_hans: 体重记录

# 你
source: You
zh_hans: 你

# 你的健康数据 + AI 分析助手
source: Your health data + AI analysis assistant
zh_hans: 你的健康数据 + AI 分析助手

# 健康数据
source: Health Data
zh_hans: 健康数据

# 免费
source: Free
zh_hans: 免费

# 全身
source: Full Body
zh_hans: 全身

# 全部
source: All
zh_hans: 全部

# 公斤
source: kg
zh_hans: 公斤

# 公里
source: km
zh_hans: 公里

# 关于
source: About
zh_hans: 关于

# 其他运动
source: Other
zh_hans: 其他运动

# 展开搜索
source: Expand search
zh_hans: 展开搜索

# 最低
source: Minimum
zh_hans: 最低

# 最低心率 %lld BPM
source: Minimum heart rate %lld BPM
zh_hans: 最低心率 %lld BPM

# 最大摄氧量
source: VO2 Max
zh_hans: 最大摄氧量

# 最新
source: Latest
zh_hans: 最新

# 最新体重 %@ %@
source: 最新体重 %1$@ %2$@
zh_hans: 最新体重 %@ %@

# 最近训练
source: Recent Workouts
zh_hans: 最近训练

# 最高
source: Maximum
zh_hans: 最高

# 最高 %@ %@
source: 最高 %1$@ %2$@
zh_hans: 最高 %@ %@

# 最高心率
source: Peak heart rate
zh_hans: 最高心率

# 最高心率 %lld BPM
source: Peak heart rate %lld BPM
zh_hans: 最高心率 %lld BPM

# 最高心率 %lld 次每分钟
source: Peak heart rate %lld bpm
zh_hans: 最高心率 %lld 次每分钟

# 分析本周训练量与频率
source: Analyze this week's training volume and frequency
zh_hans: 分析本周训练量与频率

# 分钟
source: min
zh_hans: 分钟

# 切换到训练页面以开始训练
source: Switch to the Workouts tab to start a workout
zh_hans: 切换到训练页面以开始训练

# 切换到设置页面以授权 HealthKit
source: Switch to Settings to authorize HealthKit
zh_hans: 切换到设置页面以授权 HealthKit

# 切换到设置页面配置 API Key
source: Switch to Settings to configure API key
zh_hans: 切换到设置页面配置 API Key

# 切换大字号
source: Switch to large text
zh_hans: 切换大字号

# 切换普通字号
source: Switch to normal text
zh_hans: 切换普通字号

# 划船
source: Rowing
zh_hans: 划船

# 删除
source: Delete
zh_hans: 删除

# 删除动作
source: Delete exercise
zh_hans: 删除动作

# 删除动作？
source: Delete exercise?
zh_hans: 删除动作？

# 删除失败
source: Delete failed
zh_hans: 删除失败

# 删除训练
source: Delete workout
zh_hans: 删除训练

# 刷新
source: Refresh
zh_hans: 刷新

# 刷新 AI 分析
source: Refresh AI analysis
zh_hans: 刷新 AI 分析

# 刷新训练建议
source: Refresh workout advice
zh_hans: 刷新训练建议

# 前往 [open.bigmodel.cn](https://open.bigmodel.cn) 获取 API Key
source: Get an API key at [open.bigmodel.cn](https://open.bigmodel.cn)
zh_hans: 前往 [open.bigmodel.cn](https://open.bigmodel.cn) 获取 API Key

# 前往「训练」开始第一次训练
source: Go to Workouts to start your first workout
zh_hans: 前往「训练」开始第一次训练

# 前往「设置」授权 HealthKit
source: Go to Settings to authorize HealthKit
zh_hans: 前往「设置」授权 HealthKit

# 前往「设置」配置 API Key
source: Go to Settings to configure API key
zh_hans: 前往「设置」配置 API Key

# 力量训练
source: Strength Training
zh_hans: 力量训练

# 功能性力量训练
source: Functional Strength Training
zh_hans: 功能性力量训练

# 动作库为空
source: Exercise library is empty
zh_hans: 动作库为空

# 动作操作菜单
source: Exercise actions menu
zh_hans: 动作操作菜单

# 动作数
source: Exercises
zh_hans: 动作数

# 千卡
source: kcal
zh_hans: 千卡

# 千焦
source: kJ
zh_hans: 千焦

# 单位偏好
source: Unit Preferences
zh_hans: 单位偏好

# 单侧重量
source: Per-side weight
zh_hans: 单侧重量

# 去脂体重
source: Lean Body Mass
zh_hans: 去脂体重

# 双击切换完成状态
source: Double tap to toggle completion
zh_hans: 双击切换完成状态

# 发送消息
source: Send message
zh_hans: 发送消息

# 取消
source: Cancel
zh_hans: 取消

# 变化
source: Change
zh_hans: 变化

# 变化 %@%@ %@
source: 变化 %1$@%2$@ %3$@
zh_hans: 变化 %@%@ %@

# 向 AI 助手提问关于训练和健康的问题
source: Ask the AI assistant questions about training and health
zh_hans: 向 AI 助手提问关于训练和健康的问题

# 向 AI 提问
source: Ask AI
zh_hans: 向 AI 提问

# 在列表末尾插入新的一组
source: Append a new set to the end of the list
zh_hans: 在列表末尾插入新的一组

# 均值
source: Average
zh_hans: 均值

# 均值 %lldm
source: Average %lldm
zh_hans: 均值 %lldm

# 基础代谢能量
source: Basal Energy Burned
zh_hans: 基础代谢能量

# 好
source: OK
zh_hans: 好

# 完成
source: Done
zh_hans: 完成

# 完成训练？
source: Finish workout?
zh_hans: 完成训练？

# 导入 GPX/FIT 文件
source: Import GPX/FIT file
zh_hans: 导入 GPX/FIT 文件

# 导入历史 (%lld)
source: Import history (%lld)
zh_hans: 导入历史 (%lld)

# 导出失败
source: Export failed
zh_hans: 导出失败

# 导出范围
source: Export range
zh_hans: 导出范围

# 导出训练数据 (JSON)
source: Export workout data (JSON)
zh_hans: 导出训练数据 (JSON)

# 小时
source: hr
zh_hans: 小时

# 层
source: flights
zh_hans: 层

# 左滑继续
source: Swipe left to continue
zh_hans: 左滑继续

# 已完成 %lld / %lld 组
source: Completed %1$lld of %2$lld sets
zh_hans: 已完成 %1$lld / %2$lld 组

# 已爬楼层
source: Flights Climbed
zh_hans: 已爬楼层

# 平均
source: Average
zh_hans: 平均

# 平均REM
source: Average REM
zh_hans: 平均REM

# 平均REM %@
source: Average REM %@
zh_hans: 平均REM %@

# 平均心率
source: Average heart rate
zh_hans: 平均心率

# 平均心率 %lld BPM
source: Average heart rate %lld BPM
zh_hans: 平均心率 %lld BPM

# 平均心率 %lld 次每分钟
source: Average heart rate %lld bpm
zh_hans: 平均心率 %lld 次每分钟

# 平均深睡
source: Average deep sleep
zh_hans: 平均深睡

# 平均深睡 %@
source: Average deep sleep %@
zh_hans: 平均深睡 %@

# 平均睡眠
source: Average sleep
zh_hans: 平均睡眠

# 平均睡眠 %@
source: Average sleep %@
zh_hans: 平均睡眠 %@

# 延长十秒
source: Extend 10 seconds
zh_hans: 延长十秒

# 建议
source: Suggestion
zh_hans: 建议

# 建议生成失败
source: Suggestion generation failed
zh_hans: 建议生成失败

# 开始你的健康旅程
source: Start your health journey
zh_hans: 开始你的健康旅程

# 开始分析
source: Start analysis
zh_hans: 开始分析

# 开始训练
source: Start workout
zh_hans: 开始训练

# 开源协议与致谢
source: Licenses and Acknowledgements
zh_hans: 开源协议与致谢

# 徒步
source: Hiking
zh_hans: 徒步

# 心率
source: Heart Rate
zh_hans: 心率

# 心率 %lld BPM，%@
source: 心率 %1$lld BPM，%2$@
zh_hans: 心率 %lld BPM，%@

# 心率区间：%@
source: Heart rate zones: %@
zh_hans: 心率区间：%@

# 心率变异性
source: Heart Rate Variability
zh_hans: 心率变异性

# 心率记录
source: Heart Rate Records
zh_hans: 心率记录

# 心率趋势图
source: Heart rate trend chart
zh_hans: 心率趋势图

# 心脏
source: Heart
zh_hans: 心脏

# 快捷分析
source: Quick Analysis
zh_hans: 快捷分析

# 总次数
source: Total reps
zh_hans: 总次数

# 总容量
source: Total volume
zh_hans: 总容量

# 总组数
source: Total sets
zh_hans: 总组数

# 总计
source: Total
zh_hans: 总计

# 总训练量
source: Total volume
zh_hans: 总训练量

# 总重量
source: Total weight
zh_hans: 总重量

# 恢复建议
source: Recovery Advice
zh_hans: 恢复建议

# 恢复建议，点击生成 AI 分析
source: Recovery advice, tap to generate AI analysis
zh_hans: 恢复建议，点击生成 AI 分析

# 我已了解，开始使用
source: I understand, let's start
zh_hans: 我已了解，开始使用

# 按夜明细
source: Nightly details
zh_hans: 按夜明细

# 按日明细
source: Daily details
zh_hans: 按日明细

# 授权 HealthKit
source: Authorize HealthKit
zh_hans: 授权 HealthKit

# 授权 HealthKit 查看健康数据快照，或开始你的第一次训练。
source: Authorize HealthKit to view a snapshot of your health data, or start your first workout.
zh_hans: 授权 HealthKit 查看健康数据快照，或开始你的第一次训练。

# 授权后即可查看心率、步数等健康数据。轻点下方按钮前往「设置」完成授权。
source: Once authorized, you can view health data like heart rate and step count. Tap the button below to complete authorization in Settings.
zh_hans: 授权后即可查看心率、步数等健康数据。轻点下方按钮前往「设置」完成授权。

# 授权状态
source: Authorization Status
zh_hans: 授权状态

# 推荐动作
source: Recommended exercises
zh_hans: 推荐动作

# 推荐动作：%@
source: Recommended exercises: %@
zh_hans: 推荐动作：%@

# 推荐理由
source: Rationale
zh_hans: 推荐理由

# 推荐理由：%@
source: Rationale: %@
zh_hans: 推荐理由：%@

# 推荐肌群
source: Recommended muscle groups
zh_hans: 推荐肌群

# 推荐肌群：%@
source: Recommended muscle groups: %@
zh_hans: 推荐肌群：%@

# 搜索动作
source: Search exercises
zh_hans: 搜索动作

# 撤回
source: Revoke
zh_hans: 撤回

# 撤回 AI 数据使用许可
source: Revoke AI Data Use Consent
zh_hans: 撤回 AI 数据使用许可

# 撤回后需重新确认隐私告知才能使用 AI 分析功能。
source: After revoking, you must re-confirm the privacy notice to use AI Analysis.
zh_hans: 撤回后需重新确认隐私告知才能使用 AI 分析功能。

# 撤回数据使用许可
source: Revoke data-use consent
zh_hans: 撤回数据使用许可

# 放弃
source: Discard
zh_hans: 放弃

# 放弃训练？
source: Discard workout?
zh_hans: 放弃训练？

# 数据
source: Data
zh_hans: 数据

# 数据 — Coming Soon
source: Data — Coming Soon
zh_hans: 数据 — Coming Soon

# 数据不足
source: Insufficient data
zh_hans: 数据不足

# 数据仅用于生成分析结果，具体数据处理方式以智谱 AI 服务条款为准。
source: Data is only used to generate analysis results; the exact handling is subject to Zhipu AI's terms of service.
zh_hans: 数据仅用于生成分析结果，具体数据处理方式以智谱 AI 服务条款为准。

# 数据导入
source: Data Import
zh_hans: 数据导入

# 数据导出
source: Data Export
zh_hans: 数据导出

# 数据将发送至智谱 AI（BigModel）服务器。
source: Data will be sent to Zhipu AI (BigModel) servers.
zh_hans: 数据将发送至智谱 AI（BigModel）服务器。

# 无数据
source: No data
zh_hans: 无数据

# 无氧
source: Anaerobic
zh_hans: 无氧

# 无法删除训练记录，请稍后重试。
source: Failed to delete workout record. Please try again later.
zh_hans: 无法删除训练记录，请稍后重试。

# 无法加载%@数据
source: Failed to load %@ data
zh_hans: 无法加载%@数据

# 无法加载体重数据
source: Failed to load body weight data
zh_hans: 无法加载体重数据

# 无法加载外部训练数据
source: Failed to load external workout data
zh_hans: 无法加载外部训练数据

# 无法加载心率数据
source: Failed to load heart rate data
zh_hans: 无法加载心率数据

# 无法加载步数数据
source: Failed to load step data
zh_hans: 无法加载步数数据

# 无法加载活动能量数据
source: Failed to load active-energy data
zh_hans: 无法加载活动能量数据

# 无法加载睡眠数据
source: Failed to load sleep data
zh_hans: 无法加载睡眠数据

# 无法加载运动记录
source: Unable to Load Workouts
zh_hans: 无法加载运动记录

# 无记录
source: No records
zh_hans: 无记录

# 日均
source: Daily average
zh_hans: 日均

# 日均 %@ %@，最高 %@ %@，总计 %@ %@
source: 日均 %1$@ %2$@，最高 %3$@ %4$@，总计 %5$@ %6$@
zh_hans: 日均 %@ %@，最高 %@ %@，总计 %@ %@

# 日均 %@ 步，最高 %@ 步
source: 日均 %1$@ 步，最高 %2$@ 步
zh_hans: 日均 %@ 步，最高 %@ 步

# 日均 %@ 步，最高 %@ 步，总计 %@ 步
source: 日均 %1$@ 步，最高 %2$@ 步，总计 %3$@ 步
zh_hans: 日均 %@ 步，最高 %@ 步，总计 %@ 步

# 日期
source: Date
zh_hans: 日期

# 时长
source: Duration
zh_hans: 时长

# 时间
source: Time
zh_hans: 时间

# 时间范围
source: Time range
zh_hans: 时间范围

# 显示最近 %lld 条记录（共 %lld 条）
source: 显示最近 %1$lld 条记录（共 %2$lld 条）
zh_hans: 显示最近 %lld 条记录（共 %lld 条）

# 智谱 AI
source: Zhipu AI
zh_hans: 智谱 AI

# 暂无体重数据
source: No body weight data
zh_hans: 暂无体重数据

# 暂无可用动作
source: No exercises available
zh_hans: 暂无可用动作

# 暂无心率数据
source: No heart rate data
zh_hans: 暂无心率数据

# 暂无数据
source: No Data Available
zh_hans: 暂无数据

# 暂无睡眠数据
source: No sleep data
zh_hans: 暂无睡眠数据

# 暂无训练记录
source: No workout records
zh_hans: 暂无训练记录

# 暂无运动记录
source: No Workout Records
zh_hans: 暂无运动记录

# 暂时无法生成训练建议，请稍后重试。
source: Unable to generate workout advice right now. Please try again later.
zh_hans: 暂时无法生成训练建议，请稍后重试。

# 更新于 %@
source: Updated %@
zh_hans: 更新于 %@

# 替换动作
source: Replace exercise
zh_hans: 替换动作

# 有氧
source: Cardio
zh_hans: 有氧

# 服务商
source: Provider
zh_hans: 服务商

# 本周训练总结
source: This Week's Summary
zh_hans: 本周训练总结

# 本周训练总结，点击生成 AI 分析
source: This week's summary, tap to generate AI analysis
zh_hans: 本周训练总结，点击生成 AI 分析

# 本应用
source: This app
zh_hans: 本应用

# 来源
source: Source
zh_hans: 来源

# 极限
source: Maximum
zh_hans: 极限

# 核心
source: Core
zh_hans: 核心

# 核心功能
source: Core Features
zh_hans: 核心功能

# 检查 HealthKit 授权状态
source: Check HealthKit Authorization Status
zh_hans: 检查 HealthKit 授权状态

# 检测历史最佳成绩
source: Detect historical best
zh_hans: 检测历史最佳成绩

# 椭圆机
source: Elliptical
zh_hans: 椭圆机

# 概要
source: Summary
zh_hans: 概要

# 概览
source: Overview
zh_hans: 概览

# 概览 — Coming Soon
source: Overview — Coming Soon
zh_hans: 概览 — Coming Soon

# 模型
source: Model
zh_hans: 模型

# 次
source: reps
zh_hans: 次

# 次/分
source: bpm
zh_hans: 次/分

# 正在分析
source: Analyzing
zh_hans: 正在分析

# 正在分析…
source: Analyzing…
zh_hans: 正在分析…

# 正在分析数据
source: Analyzing data
zh_hans: 正在分析数据

# 正在分析训练历史…
source: Analyzing workout history…
zh_hans: 正在分析训练历史…

# 正在加载更多训练数据
source: Loading more workout data
zh_hans: 正在加载更多训练数据

# 正在根据你的训练历史生成个性化建议…
source: Generating personalized advice based on your workout history…
zh_hans: 正在根据你的训练历史生成个性化建议…

# 正在检测可用数据…
source: Detecting available data…
zh_hans: 正在检测可用数据…

# 正在检测可用数据类型
source: Detecting available data types
zh_hans: 正在检测可用数据类型

# 正在生成 AI 健康汇总
source: Generating AI health summary
zh_hans: 正在生成 AI 健康汇总

# 正在生成建议
source: Generating advice
zh_hans: 正在生成建议

# 正在组装数据并分析…
source: Assembling data and analyzing…
zh_hans: 正在组装数据并分析…

# 步
source: steps
zh_hans: 步

# 步数
source: Steps
zh_hans: 步数

# 步行
source: Walking
zh_hans: 步行

# 步行+跑步距离
source: Walking + Running Distance
zh_hans: 步行+跑步距离

# 每日步数图
source: Daily steps chart
zh_hans: 每日步数图

# 每日活动能量图
source: Daily active-energy chart
zh_hans: 每日活动能量图

# 没有动作
source: No exercises
zh_hans: 没有动作

# 活动
source: Activity
zh_hans: 活动

# 活动能量
source: Active Energy
zh_hans: 活动能量

# 浅睡
source: Light sleep
zh_hans: 浅睡

# 消耗热量
source: Calories burned
zh_hans: 消耗热量

# 消耗热量 %@
source: Calories burned %@
zh_hans: 消耗热量 %@

# 深睡
source: Deep sleep
zh_hans: 深睡

# 添加 (%lld)
source: Add (%lld)
zh_hans: 添加 (%lld)

# 添加 %lld 个动作
source: Add %lld exercises
zh_hans: 添加 %lld 个动作

# 添加一组
source: Add a set
zh_hans: 添加一组

# 添加动作
source: Add exercise
zh_hans: 添加动作

# 添加第一个动作
source: Add first exercise
zh_hans: 添加第一个动作

# 添加递减组
source: Add drop set
zh_hans: 添加递减组

# 添加递增组
source: Add pyramid set
zh_hans: 添加递增组

# 清空对话
source: Clear conversation
zh_hans: 清空对话

# 清醒
source: Awake
zh_hans: 清醒

# 清除
source: Clear
zh_hans: 清除

# 清除 API Key
source: Clear API Key
zh_hans: 清除 API Key

# 清除搜索
source: Clear search
zh_hans: 清除搜索

# 游泳
source: Swimming
zh_hans: 游泳

# 点击 + 开始第一次训练
source: Tap + to start your first workout
zh_hans: 点击 + 开始第一次训练

# 点击下方按钮选择训练动作
source: Tap the button below to choose an exercise
zh_hans: 点击下方按钮选择训练动作

# 点击关闭
source: Tap to dismiss
zh_hans: 点击关闭

# 点击展开查看 AI 训练建议
source: Tap to expand and view AI workout advice
zh_hans: 点击展开查看 AI 训练建议

# 点击开始 AI 分析
source: Tap to start AI analysis
zh_hans: 点击开始 AI 分析

# 热身
source: Warm Up
zh_hans: 热身

# 燃脂
source: Fat Burn
zh_hans: 燃脂

# 版本
source: Version
zh_hans: 版本

# 瑜伽
source: Yoga
zh_hans: 瑜伽

# 睡眠
source: Sleep
zh_hans: 睡眠

# 睡眠分析图
source: Sleep analysis chart
zh_hans: 睡眠分析图

# 确定
source: OK
zh_hans: 确定

# 确定删除这次训练？
source: Delete this workout?
zh_hans: 确定删除这次训练？

# 确定要清除已保存的 API Key 吗？
source: Are you sure you want to clear the saved API key?
zh_hans: 确定要清除已保存的 API Key 吗？

# 确认删除
source: Confirm delete
zh_hans: 确认删除

# 确认清除
source: Confirm clear
zh_hans: 确认清除

# 确认隐私告知并开始使用 AI 功能
source: Accept the privacy notice and start using AI features
zh_hans: 确认隐私告知并开始使用 AI 功能

# 碳水化合物
source: Carbohydrates
zh_hans: 碳水化合物

# 磅
source: lb
zh_hans: 磅

# 稍后再说
source: Not now
zh_hans: 稍后再说

# 稳定
source: Stable
zh_hans: 稳定

# 空白训练
source: Blank workout
zh_hans: 空白训练

# 站立时间
source: Stand Time
zh_hans: 站立时间

# 第 %lld 组
source: Set %lld
zh_hans: 第 %lld 组

# 第 %lld 组，%@
source: 第 %1$lld 组，%2$@
zh_hans: 第 %lld 组，%@

# 第 %lld 组%@子组，%@
source: 第 %1$lld 组%2$@子组，%3$@
zh_hans: 第 %lld 组%@子组，%@

# 第 %lld 组%@子组右侧重量
source: 第 %1$lld 组%2$@子组右侧重量
zh_hans: 第 %lld 组%@子组右侧重量

# 第 %lld 组%@子组左侧重量
source: 第 %1$lld 组%2$@子组左侧重量
zh_hans: 第 %lld 组%@子组左侧重量

# 第 %lld 组%@子组次数
source: 第 %1$lld 组%2$@子组次数
zh_hans: 第 %lld 组%@子组次数

# 第 %lld 组%@子组重量
source: 第 %1$lld 组%2$@子组重量
zh_hans: 第 %lld 组%@子组重量

# 第 %lld 组右侧重量
source: Set %lld right-side weight
zh_hans: 第 %lld 组右侧重量

# 第 %lld 组左侧重量
source: Set %lld left-side weight
zh_hans: 第 %lld 组左侧重量
